// Generated by jextract

package f1.cstructs.year2021;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class wait {

    static final  GroupLayout $union$LAYOUT = MemoryLayout.unionLayout(
        Constants$root.C_INT$LAYOUT.withName("w_status"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.paddingLayout(7).withName("w_Termsig"),
                MemoryLayout.paddingLayout(1).withName("w_Coredump"),
                MemoryLayout.paddingLayout(8).withName("w_Retcode"),
                MemoryLayout.paddingLayout(16).withName("w_Filler")
            )
        ).withName("w_T"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.paddingLayout(8).withName("w_Stopval"),
                MemoryLayout.paddingLayout(8).withName("w_Stopsig"),
                MemoryLayout.paddingLayout(16).withName("w_Filler")
            )
        ).withName("w_S")
    ).withName("wait");
    public static MemoryLayout $LAYOUT() {
        return wait.$union$LAYOUT;
    }
    static final VarHandle w_status$VH = $union$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("w_status"));
    public static VarHandle w_status$VH() {
        return wait.w_status$VH;
    }
    public static int w_status$get(MemorySegment seg) {
        return (int)wait.w_status$VH.get(seg);
    }
    public static void w_status$set( MemorySegment seg, int x) {
        wait.w_status$VH.set(seg, x);
    }
    public static int w_status$get(MemorySegment seg, long index) {
        return (int)wait.w_status$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void w_status$set(MemorySegment seg, long index, int x) {
        wait.w_status$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static class w_T {

        static final  GroupLayout w_T$struct$LAYOUT = MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.paddingLayout(7).withName("w_Termsig"),
                MemoryLayout.paddingLayout(1).withName("w_Coredump"),
                MemoryLayout.paddingLayout(8).withName("w_Retcode"),
                MemoryLayout.paddingLayout(16).withName("w_Filler")
            )
        );
        public static MemoryLayout $LAYOUT() {
            return w_T.w_T$struct$LAYOUT;
        }
        public static long sizeof() { return $LAYOUT().byteSize(); }
        public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
        public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
        }
        public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
    }

    public static MemorySegment w_T$slice(MemorySegment seg) {
        return seg.asSlice(0, 4);
    }
    public static class w_S {

        static final  GroupLayout w_S$struct$LAYOUT = MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.paddingLayout(8).withName("w_Stopval"),
                MemoryLayout.paddingLayout(8).withName("w_Stopsig"),
                MemoryLayout.paddingLayout(16).withName("w_Filler")
            )
        );
        public static MemoryLayout $LAYOUT() {
            return w_S.w_S$struct$LAYOUT;
        }
        public static long sizeof() { return $LAYOUT().byteSize(); }
        public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
        public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
        }
        public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
    }

    public static MemorySegment w_S$slice(MemorySegment seg) {
        return seg.asSlice(0, 4);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
}


